{
  "id": "pf2e-magician",
  "title": "PF2e Magician",
  "version": "1.1.0",
  "compatibility": {
    "minimum": "12",
    "verified": "12"
  },
  "authors": [
    {
      "name": "Element Seven RPG",
      "email": "element_seven_rpg@protonmail.com",
      "flags": {}
    }
  ],
  "packs": [
    {
      "name": "magician",
      "label": "Magician",
      "path": "packs/magician",
      "type": "Item",
      "system": "pf2e",
      "ownership": {
        "PLAYER": "OBSERVER",
        "ASSISTANT": "OWNER"
      }
    }
  ],
  "description": "Bring the wonder of performance magic to your Pathfinder games! The magician is a character class that allows you to manipulate your enemies with subtle tricks to leave them open to your strikes. A martial class with occult magic-like effects that is fully remaster compatible.",
  "flags": {
    "pf2e-magician": {
      "pf2e-homebrew": {
        "featTraits": {
          "magician": {
            "label": "Magician",
            "description": "This indicates abilities from the magician class."
          },
          "reveal": {
            "label": "Reveal",
            "description": "Actions with this trait can only be performed when a creature is captivated by you. Performing this action ends their captivation. Any effect caused by an action with this trait ends if you captivate another creature. You may also end such an effect voluntarily as a free action on your turn."
          },
          "trick": {
            "label": "Trick",
            "description": "Only one action with this trait may be taken per turn, and may only be taken while a creature is captivated by you. Some actions with this trait have persistent effects; those effects end if you captivate another creature, the creature ceases to be captivated by you for any reason, or you take any other action with this trait. You may also end such an effect voluntarily as a free action on your turn."
          }
        }
      }
    }
  },
  "url": "https://github.com/QuickDeck/PF2e_Magician",
  "media": [
    {
      "type": "setup",
      "caption": "PF2e Magician",
      "loop": false,
      "thumbnail": "modules/pf2e-magician/img/hero.webp",
      "flags": {}
    }
  ]
}